In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
%matplotlib inline

In [7]:
df1 = sns.load_dataset("tips")
df1.head(1)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2

In [8]:
df2 = pd.read_csv("data/ece.csv")
df2.head(1)

,Series_reference,Period,Data_value,Suppressed,STATUS,UNITS,Magnitude,Subject,Group,Series_title_1,Series_title_2,Series_title_3,Series_title_4,Series_title_5
0,ECTA.S19A1,2001.03,NaN,NaN,C,Dollars,6,Electronic Card Transactions (ANZSIC06) - ECT,Total values - Electronic card transactions A/...,Actual,RTS total industries,NaN,NaN,NaN

In [12]:
x1 = np.random.rand(100, 5)
x2 = np.random.rand(10, 5)

In [19]:
df3 = pd.DataFrame(x1, columns = ['a', 'b', 'c', 'd', 'e'])
df3.head(2)

         a         b         c         d         e
0  0.28829  0.170576  0.200006  0.815409  0.517021
1  0.00190  0.959781  0.479181  0.658701  0.106314

In [20]:
df4 = pd.DataFrame(x2, columns = ['a', 'b', 'c', 'd', 'e'])
df4.head(2)

          a         b         c         d         e
0  0.199527  0.267128  0.430360  0.077497  0.614221
1  0.589164  0.462659  0.855801  0.370609  0.613791